trezor/trezor-firmware/core/embed/sdk/nrf52/examples/peripheral/radio_test/radio_cmd.c
    time = atoi(argv[1]);

    if (time > 99)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Delay time must be between 0 and 99 ms.\r\n");
        return;
    }

    m_config.delay_ms = time;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Delay time set to: %d.\r\n", time);
}


static void cmd_cancel(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    radio_test_cancel();
}


static void cmd_data_rate_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    if (argc == 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Uknown argument: %s.\r\n", argv[1]);
    }
}


static void cmd_tx_carrier_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (m_test_in_progress)
    {
        radio_test_cancel();
        m_test_in_progress = false;
    }

#if USE_MORE_RADIO_MODES
    ieee_channel_check(p_cli, m_config.channel_start);
#endif /* USE_MORE_RADIO_MODES */

    memset(&m_test_config, 0, sizeof(m_test_config));
    m_test_config.type                          = UNMODULATED_TX;
    m_test_config.mode                          = m_config.mode;
    m_test_config.params.unmodulated_tx.txpower = m_config.txpower;
    m_test_config.params.unmodulated_tx.channel = m_config.channel_start;

    radio_test_start(&m_test_config);

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Start the TX carrier.\r\n");
}

static void tx_modulated_carrier_end(void)
{
    NRF_LOG_INFO("The modulated TX has finished\n");
}

static void cmd_tx_modulated_carrier_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (m_test_in_progress)
    {
        radio_test_cancel();
        m_test_in_progress = false;
    }

#if USE_MORE_RADIO_MODES
    ieee_channel_check(p_cli, m_config.channel_start);
#endif /* USE_MORE_RADIO_MODES */

    memset(&m_test_config, 0, sizeof(m_test_config));
    m_test_config.type                        = MODULATED_TX;
    m_test_config.mode                        = m_config.mode;
    m_test_config.params.modulated_tx.txpower = m_config.txpower;
    m_test_config.params.modulated_tx.channel = m_config.channel_start;
    m_test_config.params.modulated_tx.pattern = m_config.tx_pattern;

    if (argc == 2) {
        m_test_config.params.modulated_tx.packets_num = atoi(argv[1]);
        m_test_config.params.modulated_tx.cb = tx_modulated_carrier_end;
    }

    radio_test_start(&m_test_config);

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Start the modulated TX carrier.\r\n");
}


static void cmd_duty_cycle_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    uint32_t duty_cycle;

    duty_cycle = atoi(argv[1]);

    if (duty_cycle > 100)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Duty cycle must be between 1 and 99.\r\n");
        return;
    }

    m_config.duty_cycle = duty_cycle;

#if USE_MORE_RADIO_MODES
    ieee_channel_check(p_cli, m_config.channel_start);
#endif /* USE_MORE_RADIO_MODES */

    memset(&m_test_config, 0, sizeof(m_test_config));
    m_test_config.type                                      = MODULATED_TX_DUTY_CYCLE;
    m_test_config.mode                                      = m_config.mode;
    m_test_config.params.modulated_tx_duty_cycle.txpower    = m_config.txpower;
    m_test_config.params.modulated_tx_duty_cycle.pattern    = m_config.tx_pattern;
    m_test_config.params.modulated_tx_duty_cycle.channel    = m_config.channel_start;
    m_test_config.params.modulated_tx_duty_cycle.duty_cycle = m_config.duty_cycle;

    radio_test_start(&m_test_config);
    m_test_in_progress = true;
}


static void cmd_output_power_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
    }

    if (argc == 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Uknown argument: %s.\r\n", argv[1]);
    }
}


#if USE_MORE_NRF52_RADIO_POWER_OPTIONS
static void cmd_pos8dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS8DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS8DBM));
}


static void cmd_pos7dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS7DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS7DBM));
}


static void cmd_pos6dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS6DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS6DBM));
}


static void cmd_pos5dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS5DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS5DBM));
}


static void cmd_pos2dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS2DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS2DBM));
}


