trezor/trezor-firmware/core/embed/sdk/nrf52/examples/peripheral/radio_test/radio_cmd.c
#endif // USE_MORE_NRF52_RADIO_POWER_OPTIONS


static void cmd_pos3dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS3DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS3DBM));
}


static void cmd_pos4dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_POS4DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_POS4DBM));
}


static void cmd_pos0dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_0DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n", 
                    STRINGIFY_(NRF_RADIO_TXPOWER_0DBM));
}


static void cmd_neg4dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG4DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG4DBM));
}


static void cmd_neg8dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG8DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG8DBM));
}


static void cmd_neg12dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG12DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG12DBM));
}


static void cmd_neg16dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG16DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG16DBM));
}


static void cmd_neg20dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG20DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG20DBM));
}


static void cmd_neg30dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG30DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG30DBM));
}


static void cmd_neg40dbm(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    m_config.txpower = NRF_RADIO_TXPOWER_NEG40DBM;
    nrf_cli_fprintf(p_cli, 
                    NRF_CLI_INFO, 
                    "TX power: %s\r\n",
                    STRINGIFY_(NRF_RADIO_TXPOWER_NEG40DBM));
}


static void cmd_transmit_pattern_set(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if ((argc == 1) || nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (argc > 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "%s: bad parameters count.\r\n", argv[0]);
        return;
    }

    if (argc == 2)
    {
        nrf_cli_fprintf(p_cli, NRF_CLI_ERROR, "Uknown argument: %s.\r\n", argv[1]);
    }
}


static void cmd_print(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Parameters:\r\n");

    switch (m_config.mode)
    {
#ifdef NRF52832_XXAA
        case NRF_RADIO_MODE_NRF_250KBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_NRF_250KBIT));
            break;

#endif // NRF52832_XXAA
        case NRF_RADIO_MODE_NRF_1MBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_NRF_1MBIT));
            break;

        case NRF_RADIO_MODE_NRF_2MBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_NRF_2MBIT));
            break;

        case NRF_RADIO_MODE_BLE_1MBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_BLE_1MBIT));
            break;

        case NRF_RADIO_MODE_BLE_2MBIT:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_BLE_2MBIT));
            break;

#if USE_MORE_RADIO_MODES
        case NRF_RADIO_MODE_BLE_LR125KBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_BLE_LR125KBIT));
            break;

        case NRF_RADIO_MODE_BLE_LR500KBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_BLE_LR500KBIT));
            break;

        case NRF_RADIO_MODE_IEEE802154_250KBIT:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate: %s\r\n",
                            STRINGIFY_(NRF_RADIO_MODE_IEEE802154_250KBIT));
            break;

#endif // USE_MORE_RADIO_MODES
        default:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "Data rate unknown or deprecated: %lu\n\r", 
                            m_config.mode);
            break;
    }

    switch (m_config.txpower)
    {
#if USE_MORE_NRF52_RADIO_POWER_OPTIONS
        case NRF_RADIO_TXPOWER_POS8DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS8DBM));
            break;

        case NRF_RADIO_TXPOWER_POS7DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS7DBM));
            break;

        case NRF_RADIO_TXPOWER_POS6DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS6DBM));
            break;

        case NRF_RADIO_TXPOWER_POS5DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS5DBM));
            break;

        case NRF_RADIO_TXPOWER_POS2DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS2DBM));
            break;

