trezor/trezor-firmware/core/embed/sdk/nrf52/examples/peripheral/radio_test/radio_cmd.c
#endif // USE_MORE_NRF52_RADIO_POWER_OPTIONS
        case NRF_RADIO_TXPOWER_POS4DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS4DBM));
            break;

        case NRF_RADIO_TXPOWER_POS3DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_POS3DBM));
            break;

        case NRF_RADIO_TXPOWER_0DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_0DBM));
            break;

        case NRF_RADIO_TXPOWER_NEG4DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_NEG4DBM));
            break;

        case NRF_RADIO_TXPOWER_NEG8DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_NEG8DBM));
            break;

        case NRF_RADIO_TXPOWER_NEG12DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_NEG12DBM));
            break;

        case NRF_RADIO_TXPOWER_NEG16DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_NEG16DBM));
            break;

        case NRF_RADIO_TXPOWER_NEG20DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_NEG20DBM));
            break;

        case NRF_RADIO_TXPOWER_NEG40DBM:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power: %s\r\n",
                            STRINGIFY_(NRF_RADIO_TXPOWER_NEG40DBM));
            break;

        default:
            nrf_cli_fprintf(p_cli, 
                            NRF_CLI_INFO, 
                            "TX power unknown: %d", 
                            m_config.txpower);
            break;
    }

    switch (m_config.tx_pattern)
    {
        case TRANSMIT_PATTERN_RANDOM:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO,
                            "Transmission pattern: %s\r\n",
                            STRINGIFY_(TRANSMIT_PATTERN_RANDOM));
            break;

        case TRANSMIT_PATTERN_11110000:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO,
                            "Transmission pattern: %s\r\n",
                            STRINGIFY_(TRANSMIT_PATTERN_11110000));
            break;

        case TRANSMIT_PATTERN_11001100:
            nrf_cli_fprintf(p_cli,
                            NRF_CLI_INFO,
                            "Transmission pattern: %s\r\n",
                            STRINGIFY_(TRANSMIT_PATTERN_11001100));
            break;

        default:
            nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "Transmission pattern unknown: %d", m_config.tx_pattern);
            break;
    }

nrf_cli_fprintf(p_cli, 
                NRF_CLI_INFO, 
                "Start Channel:\t%lu\r\n"
                "End Channel:\t%lu\r\n"
                "Time on each channel: %lu ms\r\n"
                "Duty cycle:\t%lu percent\r\n",
                m_config.channel_start,
                m_config.channel_end,
                m_config.delay_ms,
                m_config.duty_cycle);
}


static void cmd_rx_sweep_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    memset(&m_test_config, 0, sizeof(m_test_config));
    m_test_config.type                          = RX_SWEEP;
    m_test_config.mode                          = m_config.mode;
    m_test_config.params.rx_sweep.channel_start = m_config.channel_start;
    m_test_config.params.rx_sweep.channel_end   = m_config.channel_end;
    m_test_config.params.rx_sweep.delay_ms      = m_config.delay_ms;

    radio_test_start(&m_test_config);

    m_test_in_progress = true;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "RX sweep\r\n");
}


static void cmd_tx_sweep_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    memset(&m_test_config, 0, sizeof(m_test_config));
    m_test_config.type                          = TX_SWEEP;
    m_test_config.mode                          = m_config.mode;
    m_test_config.params.tx_sweep.channel_start = m_config.channel_start;
    m_test_config.params.tx_sweep.channel_end   = m_config.channel_end;
    m_test_config.params.tx_sweep.delay_ms      = m_config.delay_ms;
    m_test_config.params.tx_sweep.txpower       = m_config.txpower;

    radio_test_start(&m_test_config);

    m_test_in_progress = true;

    nrf_cli_fprintf(p_cli, NRF_CLI_INFO, "TX sweep\r\n");
}


static void cmd_rx_start(nrf_cli_t const * p_cli, size_t argc, char ** argv)
{
    if (nrf_cli_help_requested(p_cli))
    {
        nrf_cli_help_print(p_cli, NULL, 0);
        return;
    }

    if (m_test_in_progress)
    {
        radio_test_cancel();
        m_test_in_progress = false;
    }

#if USE_MORE_RADIO_MODES
    ieee_channel_check(p_cli, m_config.channel_start);
#endif /* USE_MORE_RADIO_MODES */

    memset(&m_test_config, 0, sizeof(m_test_config));
    m_test_config.type              = RX;
    m_test_config.mode              = m_config.mode;
    m_test_config.params.rx.channel = m_config.channel_start;
    m_test_config.params.rx.pattern = m_config.tx_pattern;

    radio_test_start(&m_test_config);
}


